In [ ]:
import pandas as pd, numpy as np

In [ ]:
import pandas as pd
import numpy as np

##Mahasiswa Jurusan Statistika##

In [ ]:
Id_Mhs = [201643500703, 201643500700, 201643500715, 201643500723, 201643500700, 201643500730, 201643500733, 210643500743, 201643500745, 201643500757]
Nama = ['Rama', 'Rossali', 'Ilham', 'Bayu', 'Bambang', 'Allivia', 'Aldila', ' Sri', 'Riyan', 'Tresna']
Mata_Kuliah = ['Kalkulus', 'Metode Numerik', 'Statistika Multivariat', 'Analisa Regresi', 'Teknik Simulasi', 'Analisa Regresi', 'Statistika Nonparametrik', 'Metode Numerik', 'Kalkulus', 'Survey Sampel']
Nilai = [90, 80, 70, 60, 65, 78, 89, 75, 66, 60]

Mhs_Statistika = {
    'Id_Mhs': Id_Mhs,
    'Nama': Nama,
    'Mata_Kuliah': Mata_Kuliah,
    'Nilai': Nilai
}
df = pd.DataFrame(Mhs_Statistika)
df

         Id_Mhs     Nama               Mata_Kuliah  Nilai
0  201643500703     Rama                  Kalkulus     90
1  201643500700  Rossali            Metode Numerik     80
2  201643500715    Ilham    Statistika Multivariat     70
3  201643500723     Bayu           Analisa Regresi     60
4  201643500700  Bambang           Teknik Simulasi     65
5  201643500730  Allivia           Analisa Regresi     78
6  201643500733   Aldila  Statistika Nonparametrik     89
7  210643500743      Sri            Metode Numerik     75
8  201643500745    Riyan                  Kalkulus     66
9  201643500757   Tresna             Survey Sampel     60

##Informasi Hewan di Kebun Binatang##

In [ ]:
Jenis_Hewan = tuple(['Jerapah', 'Gajah', 'Buaya', 'Lemur', 'Caracal', 'Serval', 'Otter', 'Singa', 'Kuda Nil', 'Panda'])
Nama_Panggilan = tuple(['Melman','Giant','Rizal','King Julien', 'Uma','Muezza', 'Jotaro', 'Alex', 'Gloria', 'Po'])
Kapan_Dilahirkan = tuple(['2016-03-03', '2015-05-12', '2017-10-20', '2019-07-30', '2020-12-12', '2020-01-19', '2021-02-13', '2017-08-15', '2018-06-06', '2014-09-16'])
Usia = tuple(['5 Tahun 3 Bulan', '6 Tahun 1 Bulan', '4 Tahun 8 Bulan', '1 Tahun 11 Bulan', '6 Bulan', '5 Bulan', '4 Bulan', '3 Tahun 10 Bulan', '3 Tahun', '6 Tahun 9 Bulan'])
Jenis_Kelamin = tuple(['Jantan', 'Betina', 'Betina', 'Jantan', 'Jantan', 'Betina', 'Betina','Betina', 'Jantan','Jantan'])
df4 = pd.DataFrame([Jenis_Hewan, Nama_Panggilan, Kapan_Dilahirkan, Usia, Jenis_Kelamin ]).T
df4

          0            1           2                 3       4
0   Jerapah       Melman  2016-03-03   5 Tahun 3 Bulan  Jantan
1     Gajah        Giant  2015-05-12   6 Tahun 1 Bulan  Betina
2     Buaya        Rizal  2017-10-20   4 Tahun 8 Bulan  Betina
3     Lemur  King Julien  2019-07-30  1 Tahun 11 Bulan  Jantan
4   Caracal          Uma  2020-12-12           6 Bulan  Jantan
5    Serval       Muezza  2020-01-19           5 Bulan  Betina
6     Otter       Jotaro  2021-02-13           4 Bulan  Betina
7     Singa         Alex  2017-08-15  3 Tahun 10 Bulan  Betina
8  Kuda Nil       Gloria  2018-06-06           3 Tahun  Jantan
9     Panda           Po  2014-09-16   6 Tahun 9 Bulan  Jantan